# 6.1 算术运算
# 6.1.1 基本算数运算符
print(10+3)    #1）加法运算
print(10-3)    #2）减法运算
print(10*3)    #3）乘法运算
print(10/3)    #4）除不尽时可以得到浮点数结果的除法运算
print(10//3)   #5）除不尽时保留整数的除法运算
print(10%3)    #6）取余运算
print(10**3)   #7) 幂运算
'''
运行结果：
----------------------
13
7
30
3.3333333333333335
3
1
1000
----------------------
'''
# 6.1.2 增广赋值运算符
x = 10; x = x + 3
print(x)
x = 10; x += 3         # 1.加法（本行等价于第24行）
print(x)
x = 10; x -= 3         # 2.减法
print(x)
x = 10; x *= 3         # 3.乘法
print(x)
x = 10; x /= 3         # 4.除法（除不尽时可以得到浮点数）
print(x)
x = 10; x //= 3        # 5.除法（除不尽时去掉小数点后的部分保留整数）
print(x)
x = 10; x %= 3         # 6.取余
print(x)
x = 10; x **= 3        # 7.幂运算（等价于x = x**3）
print(x)
'''
运行结果：
------------
13
13
7
30
3.3333333333333335
3
1
1000
------------
'''